{
  "poems": [
    {
      "title": "At the edge",
      "date": "February 26, 2025",
      "content": "Somewhere in the savanah, it’s just us. Hunter and prey.\nWe move slowly, certain that the ground is unsteady.\nThe shifting wind leaning in anticipation, as if they had a dog in the fight.\nA canopy of clouds assemble at the edge of our sight.\nSongs were never meant to last this long\nYou replay the same memories, wishing there was an edit button\nThe lights wink at the window, like they’re tired of the dark\nI watch the clock, but time won’t keep its hands to itself\nOur cups aren’t empty, just full of tiny particles that forever fly\nStill, we sit here, convinced that thinking machines aren’t magic\n"
    },
    {
      "title":"the secret sauce",
      "date": "February 25, 2025",
      "content": "How do you talk like a poet\nHow ?\nI have tried to solve this riddle, and,\nI think there is room for growth\nI start too many lines with “And”\nToo many sentences with ”I”\nSo, it probably reads too cliche\nWhen do I start to feel among\nAnd have my pieces read like the\nAuthors I read their works on rattle.com\nOr the many publications I’ve seen on X,\nhousing submissions that really intimidate\nThey have pages lined with text, full to the brim\nInflections in weird but strategic places\nAnd it all rhymes in an uncommon way, where\nThe words do not end with the same sound\nBut the shoe just fits\nYou know what I mean?\nAlmost as if\nthey had a manual\nThat taught them how to cast spells\nWithout uttering a syllable\nBut with the strokes of their pen\nEngraved on a digital screen in the wild\nI wish I had this manual\nAnd I could talk like a poet\nMaybe I would do a better job at a cliffhanger"
    },
    {
      "title": "One for them and one for me",
      "date": "February 25, 2025",
      "content": "I thought about what would be an eye catching piece for my WhatsApp story \nI manage to attract a few admirers there\nThey enjoy when I appear with a new piece\nOut of the blue, with lengthy texts about love\nSometimes I wonder if they know the true stories behind what they read\nOr they just get it\nWell, what do I mean?\nI mean, “they just get it”. They interpret as they wish\nWhat they make of it is theirs to choose\nFrom the moment its light met their eyes\nAnd the neurons in their brain popped open with words\nThe words ceased to be mine\nIt became whatever story was told in that shiny corner of their head\nFrom then on, the piece diverges\nOne for them and one for me\nFor them, the words draw a pattern on the sand\nIts grains hit close to home\nAnd it gets especially muddy when it rains\nFor me, the texts run in multiple directions\nLike I do when playing football\nKnowing the goal lies at both ends of the pitch\nOne for them and one for me."
    },
    {
      "title": "Plane",
      "date": "January 2025",
      "content": "More words to share"
    },
    {
      "title": "fingers",
      "date": "January 2025",
      "content": "My fingers write so fast,\nsometimes I feel like I’m left out,\nmerely observing the speed and joy with which words emerge—\nsentences both flawed and flawless lining up.\n\nYet, eventually, I join the party\nto smooth the edges,\nremove misplaced lettrers,\nand rewrite the statements borne of this euphoria.\n\nI do not mind;\nwe do not mind,\nfor every piece,\nwhether polished or half-baked,\nis ours to claim.\n\nTogether, we create,\npushing until meanings exhaust\nand the plot dissolves like sweat stolen by cold air.\n\nStill, we write,\ndrawing from what feels like endless pools of creativity.\n\nIf you’re still here,\nreading this reckless exercise,\nyou have my gratitude.\n\nNo proofreading will follow;\nthis is a tribute to my fingers—\ntireless, strong, and long—\nthe pen that was never titled,\nthe ink with which I write.\n\nOr perhaps it’s my brain?\nBut let’s not lose ourselves in that debate.\n\nForgive me, reader,\nfor this is about nothing\nanyone would want to read—\nnot even me, the writer.\n\nOr is it my fingers,\nwho could never read?"
    }
  ]
}
